content/posts/representation_theory.md
+++
title = "representation theory"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:37:39-04:00
slug = "representation_theory"
draft = false
+++

## references {#references}


### [Notes on representation theory and quantum mechanics by Noah Miller in 2018]({{< relref "Notes_on_representation_theory_and_quantum_mechanics_by_Noah_Miller_in_2018" >}}) {#notes-on-representation-theory-and-quantum-mechanics-by-noah-miller-in-2018--notes-on-representation-theory-and-quantum-mechanics-by-noah-miller-in-2018-dot-md}


### [The unitary representations of the Poincare group in any spacetime dimension by Xavier Bekaert and Nicolas Boulanger in 2006]({{< relref "The_unitary_representations_of_the_Poincare_group_in_any_spacetime_dimension_by_Xavier_Bekaert_and_Nicolas_Boulanger_in_2006" >}}) {#the-unitary-representations-of-the-poincare-group-in-any-spacetime-dimension-by-xavier-bekaert-and-nicolas-boulanger-in-2006--the-unitary-representations-of-the-poincare-group-in-any-spacetime-dimension-by-xavier-bekaert-and-nicolas-boulanger-in-2006-dot-md}


## The development of the representation theory [of the Lorentz group] has historically followed the development of the more general theory of representation theory of semisimple groups, largely due to Élie Cartan and Hermann Weyl, but the Lorentz group has also received special attention due to its importance in physics. Notable contributors are physicist E. P. Wigner and mathematician Valentine Bargmann with their Bargmann–Wigner program,[1] one conclusion of which is, roughly, ^^a classification of all unitary representations of the inhomogeneous Lorentz group amounts to a classification of all possible relativistic wave equations^^.[2] The classification of the irreducible infinite-dimensional representations of the Lorentz group was established by Paul Dirac's doctoral student in theoretical physics, Harish-Chandra, later turned mathematician,[nb 3] in 1947. The corresponding classification for \\[ \mathrm {SL} (2,\mathbb {C} )\\] was published independently by Bargmann and Israel Gelfand together with Mark Naimark in the same year. — via [Representation theory of the Lorentz group \* Wikipedia](<https://en.wikipedia.org/wiki/Representation%5Ftheory%5Fof%5Fthe%5FLorentz%5Fgroup#Development>) {#the-development-of-the-representation-theory-of-the-lorentz-group-has-historically-followed-the-development-of-the-more-general-theory-of-representation-theory-of-semisimple-groups-largely-due-to-élie-cartan-and-hermann-weyl-but-the-lorentz-group-has-also-received-special-attention-due-to-its-importance-in-physics-dot-notable-contributors-are-physicist-e-dot-p-dot-wigner-and-mathematician-valentine-bargmann-with-their-bargmann-wigner-program-1-one-conclusion-of-which-is-roughly-a-classification-of-all-unitary-representations-of-the-inhomogeneous-lorentz-group-amounts-to-a-classification-of-all-possible-relativistic-wave-equations-dot-2-the-classification-of-the-irreducible-infinite-dimensional-representations-of-the-lorentz-group-was-established-by-paul-dirac-s-doctoral-student-in-theoretical-physics-harish-chandra-later-turned-mathematician-nb-3-in-1947-dot-the-corresponding-classification-for-mathrm-sl--2-mathbb-c--was-published-independently-by-bargmann-and-israel-gelfand-together-with-mark-naimark-in-the-same-year-dot-via-representation-theory-of-the-lorentz-group-wikipedia--https-en-dot-wikipedia-dot-org-wiki-representation-theory-of-the-lorentz-group-development}


### Reference 2 is {#reference-2-is}

<!--list-separator-->

-  [The unitary representations of the Poincare group in any spacetime dimension by Xavier Bekaert and Nicolas Boulanger in 2006]({{< relref "The_unitary_representations_of_the_Poincare_group_in_any_spacetime_dimension_by_Xavier_Bekaert_and_Nicolas_Boulanger_in_2006" >}})

<!--list-separator-->

-  Bekaert, X., & Boulanger, N. (2006). The unitary representations of the Poincare group in any spacetime dimension, 1–50. Retrieved from <http://arxiv.org/abs/hep-th/0611263>

    <!--list-separator-->

    -  page 6 contains the referenced quote

        <!--list-separator-->

        -  "A classification of all unitary representations of the inhomogeneous Lorentz group, i.e. of all solutions of (6), amounts, therefore, to a classification of all possible relativistic wave equations."
